In [1]:
import pandas as pd

#load two data files 
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load= "Resources/students_complete.csv"

#read the data from csv into a dataframe

school_data_df = pd.read_csv(school_data_to_load)
student_data_df = pd.read_csv(student_data_to_load)

In [2]:
#determine if there are missing values in the student data frame
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [3]:
#see if any null data

school_data_df.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [4]:
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [5]:
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [6]:
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [8]:
#fix the student names to take out the extra words
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

#need to convert the student name to a string (not an object) for replace to work 

for i in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(i,"")

student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [10]:
#merge the two dataframes
#check what is common

school_data_df.head()

#school name is the same

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [13]:
school_data_complete_df = pd.merge(student_data_df, school_data_df, on = ["school_name","school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [20]:
#get student count, pick any column since they all have same number of entries - 39170
student_count = school_data_complete_df["Student ID"].count()

In [21]:
student_count

39170

In [27]:
schools = school_data_complete_df["school_name"].unique()

In [39]:
school_count = len(schools)
school_count

15

In [31]:
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [38]:
average_reading_score = school_data_complete_df["reading_score"].mean()

In [42]:
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [54]:
passing_math =school_data_complete_df[school_data_complete_df["math_score"]>=70]
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"]>=70]
passing_math_count = passing_math["student_name"].count()

In [55]:
passing_reading_count = passing_reading["student_name"].count()

In [56]:
passing_reading_count

33610

In [57]:
passing_math_count

29370